Wakayo-Quozorox/SACS/STM32/bsp/inc/SX1272.h
// Structure pack :
typedef struct
{
	// Structure Variable : Packet destination
	uint8_t dst;
	// Structure Variable : Packet source
	uint8_t src;
	// Structure Variable : Packet number
	uint8_t packnum;
	// Structure Variable : Packet length
	uint8_t length;
	// Structure Variable : Packet payload
	uint8_t data[MAX_PAYLOAD];
	// Structure Variable : Retry number
	uint8_t retry;
}pack;

// Structure SX1272status :
typedef struct
{
/// Variables /////////////////////////////////////////////////////////////

// Variable : SD state.
//    st_SD = 00  --> SD_OFF
//    st_SD = 01  --> SD_ON
uint8_t st_SD;

// Variable : bandwidth configured in LoRa mode.
//    bandwidth = 00  --> BW = 125KHz
//    bandwidth = 01  --> BW = 250KHz
//    bandwidth = 10  --> BW = 500KHz
uint8_t _bandwidth;

// Variable : coding rate configured in LoRa mode.
//    codingRate = 001  --> CR = 4/5
//    codingRate = 010  --> CR = 4/6
//    codingRate = 011  --> CR = 4/7
//    codingRate = 100  --> CR = 4/8
uint8_t _codingRate;

// Variable : spreading factor configured in LoRa mode.
//    spreadingFactor = 6   --> SF = 6, 64 chips/symbol
//    spreadingFactor = 7   --> SF = 7, 128 chips/symbol
//    spreadingFactor = 8   --> SF = 8, 256 chips/symbol
//    spreadingFactor = 9   --> SF = 9, 512 chips/symbol
//    spreadingFactor = 10  --> SF = 10, 1024 chips/symbol
//    spreadingFactor = 11  --> SF = 11, 2048 chips/symbol
//    spreadingFactor = 12  --> SF = 12, 4096 chips/symbol
uint8_t _spreadingFactor;

// Variable : frequency channel.
//		channel= 0xD90666  --> CH = 868.10MHz
//		channel= 0xD91333  --> CH = 868.30MHz
//		channel= 0xD92000  --> CH = 868.50MHz
// Other channels:
//    channel = 0xD84CCC  --> CH = 10_868, 865.20MHz
//    channel = 0xD86000  --> CH = 11_868, 865.50MHz
//    channel = 0xD87333  --> CH = 12_868, 865.80MHz
//    channel = 0xD88666  --> CH = 13_868, 866.10MHz
//    channel = 0xD89999  --> CH = 14_868, 866.40MHz
//    channel = 0xD8ACCC  --> CH = 15_868, 866.70MHz
//    channel = 0xD8C000  --> CH = 16_868, 867.00MHz
//    channel = 0xE1C51E  --> CH = 00_900, 903.08MHz
//    channel = 0xE24F5C  --> CH = 01_900, 905.24MHz
//    channel = 0xE2D999  --> CH = 02_900, 907.40MHz
//    channel = 0xE363D7  --> CH = 03_900, 909.56MHz
//    channel = 0xE3EE14  --> CH = 04_900, 911.72MHz
//    channel = 0xE47851  --> CH = 05_900, 913.88MHz
//    channel = 0xE5028F  --> CH = 06_900, 916.04MHz
//    channel = 0xE58CCC  --> CH = 07_900, 918.20MHz
//    channel = 0xE6170A  --> CH = 08_900, 920.36MHz
//    channel = 0xE6A147  --> CH = 09_900, 922.52MHz
//    channel = 0xE72B85  --> CH = 10_900, 924.68MHz
//    channel = 0xE7B5C2  --> CH = 11_900, 926.84MHz
uint32_t _channel;

// Variable : output power.
uint8_t _power;

// Variable : SNR from the last packet received in LoRa mode.
int8_t _SNR;

// Variable : RSSI current value.
int8_t _RSSI;

// Variable : RSSI from the last packet received in LoRa mode.
int16_t _RSSIpacket;

// Variable : preamble length sent/received.
uint16_t _preamblelength;

// Variable : payload length sent/received.
uint16_t _payloadlength;

// Variable : node address.
uint8_t _nodeAddress;

// Variable : implicit or explicit header in LoRa mode.
uint8_t _header;

// Variable : header received while waiting a packet to arrive.
uint8_t _hreceived;

// Variable : presence or absence of CRC calculation.
uint8_t _CRC;

// Variable : packet destination.
uint8_t _destination;

// Variable : packet number.
uint8_t _packetNumber;

// Variable : indicates if received packet is correct or incorrect.
uint8_t _reception;

// Variable : number of current retry.
uint8_t _retries;

// Variable : maximum number of retries.
uint8_t _maxRetries;

// Variable : maximum current supply.
uint8_t _maxCurrent;

// Variable : indicates FSK or LoRa modem.
uint8_t _modem;

// Variable : array with all the information about a sent packet.
pack packet_sent;

// Variable : array with all the information about a received packet.
pack packet_received;

// Variable : array with all the information about a sent/received ack.
pack ACK;

// Variable : temperature module.
int _temp;

// Variable : current timeout to send a packet.
uint16_t _sendTime;

}SX1272status;



// It puts the module ON
uint8_t BSP_SX1272_ON(int type_mod);
// It puts the module OFF
void BSP_SX1272_OFF(int type_mod);
// It clears the interruption flags.
void BSP_SX1272_clearFlags();

// It sets the LoRa mode on.
/* It stores in global '_LORA' variable '1' when success
\return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_setLORA();

// It sets the FSK mode on.
/* It stores in global '_FSK' variable '1' when success
 * \return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_setFSK();

// It gets the BW, SF and CR of the module.
/* It stores in global '_bandwidth' variable the BW
It stores in global '_codingRate' variable the CR
It stores in global '_spreadingFactor' variable the SF
\return '0' on success, '1' otherwise  */
uint8_t BSP_SX1272_getMode();

// It sets the BW, SF and CR of the module.
/* It stores in global '_bandwidth' variable the BW
It stores in global '_codingRate' variable the CR
It stores in global '_spreadingFactor' variable the SF
\param uint8_t mode : there is a mode number to different values of
the	configured parameters with this function.
\return '0' on success, '1' otherwise  */
int8_t BSP_SX1272_setMode(uint8_t mode);

// It gets the header mode configured.
/* It stores in global '_header' variable '0' when header is sent
(explicit header mode) or '1' when is not sent (implicit header
mode).
\return '0' on success, '1' otherwise */
uint8_t	BSP_SX1272_getHeader();

// It sets explicit header mode.
/* It stores in global '_header' variable '1' when success
\return '0' on success, '1' otherwise  */
int8_t	BSP_SX1272_setHeaderON();

// It sets implicit header mode.
/* It stores in global '_header' variable '0' when success
\return '0' on success, '1' otherwise  */
int8_t	BSP_SX1272_setHeaderOFF();

// It gets the CRC configured.
/* It stores in global '_CRC' variable '1' enabling CRC generation on
payload, or '0' disabling the CRC.
\return '0' on success, '1' otherwise  */
uint8_t	BSP_SX1272_getCRC();

