Wakayo-Quozorox/SACS/STM32/bsp/inc/SX1272.h
// It sets CRC on.
/* It stores in global '_CRC' variable '1' when success
\return '0' on success, '1' otherwise  */
uint8_t	BSP_SX1272_setCRC_ON();

// It sets CRC off.
/* It stores in global '_CRC' variable '0' when success
\return '0' on success, '1' otherwise  */
uint8_t	BSP_SX1272_setCRC_OFF();

// It is true if the SF selected exists.
/* \param uint8_t spr : spreading factor value to check.
\return 'true' on success, 'false' otherwise*/
uint8_t	BSP_SX1272_isSF(uint8_t spr);

// It gets the SF configured.
/* It stores in global '_spreadingFactor' variable the current value of SF
\return '0' on success, '1' otherwise */
int8_t	BSP_SX1272_getSF();

// It sets the SF.
/* It stores in global '_spreadingFactor' variable the current value of SF
\param uint8_t spr : spreading factor value to set in the configuration.
\return '0' on success, '1' otherwise  */
uint8_t	BSP_SX1272_setSF(uint8_t spr);

// It is true if the BW selected exists.
/* \param uint16_t band : bandwidth value to check.
\return 'true' on success, 'false' otherwise */
uint8_t	BSP_SX1272_isBW(uint16_t band);

// It gets the BW configured.
/* It stores in global '_bandwidth' variable the BW selected
in the configuration
\return '0' on success, '1' otherwise */
int8_t	BSP_SX1272_getBW();

// It sets the BW.
/* It stores in global '_bandwidth' variable the BW selected
in the configuration
\param uint16_t band : bandwidth value to set in the configuration.
\return '0' on success, '1' otherwise */
int8_t BSP_SX1272_setBW(uint16_t band);

// It is true if the CR selected exists.
/* \param uint8_t cod : the coding rate value to check.
\return 'true' on success, 'false' otherwise  */
uint8_t	BSP_SX1272_isCR(uint8_t cod);

// It gets the CR configured.
/* It stores in global '_codingRate' variable the CR selected
in the configuration
\return '0' on success, '1' otherwise */
int8_t	BSP_SX1272_getCR();

// It sets the CR.
/* It stores in global '_codingRate' variable the CR selected
in the configuration
\param uint8_t cod : coding rate value to set in the configuration.
\return '0' on success, '1' otherwise  */
int8_t	BSP_SX1272_setCR(uint8_t cod);

// It is true if the channel selected exists.
/* \param uint32_t ch : frequency channel value to check.
\return 'true' on success, 'false' otherwise  */
uint8_t BSP_SX1272_isChannel(uint32_t ch);

// It gets frequency channel the module is using.
/* It stores in global '_channel' variable the frequency channel
\return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_getChannel();

// It sets frequency channel the module is using.
/* It stores in global '_channel' variable the frequency channel
\param uint32_t ch : frequency channel value to set in the configuration.
\return '0' on success, '1' otherwise */
int8_t BSP_SX1272_setChannel(uint32_t ch);

// It gets the output power of the signal.
/* It stores in global '_power' variable the output power of the signal
\return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_getPower();

// It sets the output power of the signal.
/* It stores in global '_power' variable the output power of the signal
\param uint8_t pow : value to set as output power.
\return '0' on success, '1' otherwise */
int8_t BSP_SX1272_setPower(uint8_t pow);

// It gets the preamble length configured.
/* It stores in global '_preamblelength' variable the preamble length
\return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_getPreambleLength();

// It sets the preamble length.
/* It stores in global '_preamblelength' variable the preamble length
\param uint16_t l : preamble length to set in the configuration.
\return '0' on success, '1' otherwise  */
uint8_t BSP_SX1272_setPreambleLength(uint16_t l);

// It gets the payload length of the last packet to send/receive.
/* It stores in global '_payloadlength' variable the payload length of
the last packet to send/receive.
\return '0' on success, '1' otherwise  */
uint8_t BSP_SX1272_getPayloadLength();

// It sets the packet length to send/receive.
/* It stores in global '_payloadlength' variable the payload length of
the last packet to send/receive.
\param uint8_t l : payload length to set in the configuration.
\return '0' on success, '1' otherwise  */
int8_t BSP_SX1272_setPacketLength(uint8_t l);

// It gets the node address of the mote.
/* It stores in global '_nodeAddress' variable the node address
\return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_getNodeAddress();

// It sets the node address of the mote.
/*
It stores in global '_nodeAddress' variable the node address
\param uint8_t addr : address value to set as node address.
\return '0' on success, '1' otherwise  */
int8_t BSP_SX1272_setNodeAddress(uint8_t addr);

// It gets the SNR of the latest received packet.
/* It stores in global '_SNR' variable the SNR
\return '0' on success, '1' otherwise */
int8_t BSP_SX1272_getSNR();

// It gets the current value of RSSI.
/* It stores in global '_RSSI' variable the current value of RSSI
\return '0' on success, '1' otherwise  */
uint8_t BSP_SX1272_getRSSI();

// It gets the RSSI of the latest received packet.
/* It stores in global '_RSSIpacket' variable the RSSI of the latest
packet received.
\return '0' on success, '1' otherwise  */
int16_t BSP_SX1272_getRSSIpacket();

// It sets the total of retries when a packet is not correctly received.
/* It stores in global '_maxRetries' variable the number of retries.
\param uint8_t ret : number of retries.
\return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_setRetries(uint8_t ret);

// It gets the maximum current supply by the module.
/* *
\return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_getMaxCurrent();

// It sets the maximum current supply by the module.
/* It stores in global '_maxCurrent' variable the maximum current supply.
\param uint8_t rate : maximum current supply.
\return '0' on success, '1' otherwise  */
int8_t BSP_SX1272_setMaxCurrent(uint8_t rate);

// It gets the content of the main configuration registers.
/* It stores in global '_bandwidth' variable the BW.
It stores in global '_codingRate' variable the CR.
It stores in global '_spreadingFactor' variable the SF.
It stores in global '_power' variable the output power of the signal.
It stores in global '_channel' variable the frequency channel.
It stores in global '_CRC' variable '1' enabling CRC generation on
payload, or '0' disabling the CRC.
It stores in global '_header' variable '0' when header is sent
(explicit header mode) or '1' when is not sent (implicit header
mode).
It stores in global '_preamblelength' variable the preamble length.
It stores in global '_payloadlength' variable the payload length of
the last packet to send/receive.
It stores in global '_nodeAddress' variable the node address.
It stores in global '_temp' variable the module temperature.
\return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_getRegs();

// It sets the maximum number of uint8_ts from a frame that fit in a packet
// structure.
/* It stores in global '_payloadlength' variable the maximum number of uint8_ts.
\param uint16_t length16 : total frame length.
\return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_truncPayload(uint16_t length16);

// It writes an ACK in FIFO to send it.
/* *
\return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_setACK();

// It puts the module in reception mode.
/* *
\return '0' on success, '1' otherwise  */
uint8_t BSP_SX1272_receive();

// It receives a packet before MAX_TIMEOUT.
/*  *
\return '0' on success, '1' otherwise  */
uint8_t BSP_SX1272_receivePacketMAXTimeout();

