Wakayo-Quozorox/SACS/STM32/bsp/inc/SX1272.h
// It receives a packet before a timeout.
/* \param uint32_t wait : time to wait to receive something.
\return '0' on success, '1' otherwise  */
uint8_t BSP_SX1272_receivePacketTimeout(uint32_t wait);

// It receives a packet before MAX_TIMEOUT and reply with an ACK.
/* *
\return '0' on success, '1' otherwise  */
uint8_t BSP_SX1272_receivePacketMAXTimeoutACK();

// It receives a packet before a timeout and reply with an ACK.
/* \param uint32_t wait : time to wait to receive something.
\return '0' on success, '1' otherwise  */
uint8_t BSP_SX1272_receivePacketTimeoutACK(uint32_t wait);

// It puts the module in 'promiscuous' reception mode with a timeout.
/* \param uint32_t wait : time to wait to receive something.
\return '0' on success, '1' otherwise  */
uint8_t BSP_SX1272_receiveAll(uint32_t wait);

// It checks if there is an available packet and its destination before a
// timeout.
/* *
\param uint32_t wait : time to wait while there is no a valid header
received.
\return 'true' on success, 'false' otherwise  */
uint8_t	BSP_SX1272_availableData(uint32_t wait);

// It writes a packet in FIFO in order to send it.
/* \param uint8_t dest : packet destination.
\param char *payload : packet payload.
\return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_setPacket(uint8_t dest, char *payload);

// It writes a packet in FIFO in order to send it.
/* \param uint8_t dest : packet destination.
\param uint8_t *payload: packet payload.
\return '0' on success, '1' otherwise */
//uint8_t BSP_SX1272_setPacket(uint8_t dest, uint8_t *payload);

// It reads a received packet from the FIFO, if it arrives before ending
// MAX_TIMEOUT time.
/*  *
\return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_getPacketMAXTimeout();

// It receives and gets a packet from FIFO, if it arrives before ending
// 'wait' time.
/*  *
\param uint32_t wait : time to wait while there is not a complete packet
received.
\return '0' on success, '1' otherwise */
int8_t BSP_SX1272_getPacket(uint32_t wait);

// It sends the packet stored in FIFO before ending MAX_TIMEOUT.
/* *
\return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_sendWithMAXTimeout();

// It tries to send the packet stored in FIFO before ending 'wait' time.
/* \param uint32_t wait : time to wait to send the packet.
\return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_sendWithTimeout(uint32_t wait);

// It tries to send the packet which payload is a parameter before ending
// MAX_TIMEOUT.
/* \param uint8_t dest : packet destination.
\param char *payload : packet payload.
\return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_sendPacketMAXTimeout(	uint8_t dest,char *payload);

// It tries to send the packet which payload is a parameter before ending
// MAX_TIMEOUT.
/* \param uint8_t dest : packet destination.
\param uint8_t *payload : packet payload.
\param uint16_t length : payload buffer length.
\return '0' on success, '1' otherwise */
//uint8_t sendPacketMAXTimeout(	uint8_t dest,
//								uint8_t *payload,
//								uint16_t length);

// It sends the packet which payload is a parameter before ending
// MAX_TIMEOUT.
/* \param uint8_t dest : packet destination.
\param uint8_t *payload: packet payload.
\param uint16_t length : payload buffer length.
\return '0' on success, '1' otherwise */
//uint8_t sendPacketTimeout(	uint8_t dest,
//							uint8_t *payload,
//							uint16_t length);

// It sends the packet which payload is a parameter before ending 'wait'
// time.
/* \param uint8_t dest : packet destination.
\param char *payload : packet payload.
\param uint32_t wait : time to wait.
\return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_sendPacketTimeout(	uint8_t dest,
							char *payload,
							uint32_t wait);

// It sends the packet which payload is a parameter before ending 'wait'
// time.
/* \param uint8_t dest : packet destination.
\param uint8_t *payload : packet payload.
\param uint16_t length : payload buffer length.
\param uint32_t wait : time to wait.
\return '0' on success, '1' otherwise */
//uint8_t sendPacketTimeout(	uint8_t dest,
//							uint8_t *payload,
//							uint16_t length,
//							uint32_t wait);

// It sends the packet which payload is a parameter before MAX_TIMEOUT,
// and replies with ACK.
/* \param uint8_t dest : packet destination.
\param char *payload : packet payload.
\return '9'  --> The ACK lost (no data available)
		'8'  --> The ACK lost
		'7'  --> The ACK destination incorrectly received
		'6'  --> The ACK source incorrectly received
		'5'  --> The ACK number incorrectly received
		'4'  --> The ACK length incorrectly received
		'3'  --> N-ACK received
		'2'  --> The ACK has not been received
		'1'  --> not used (reserved)
		'0'  --> The ACK has been received with no errors */
uint8_t sendPacketMAXTimeoutACK(uint8_t dest,
								char *payload);

// It sends the packet which payload is a parameter before MAX_TIMEOUT,
// and replies with ACK.
/* \param uint8_t dest : packet destination.
\param uint8_t payload: packet payload.
\param uint16_t length : payload buffer length.
\return '9'  --> The ACK lost (no data available)
		'8'  --> The ACK lost
		'7'  --> The ACK destination incorrectly received
		'6'  --> The ACK source incorrectly received
		'5'  --> The ACK number incorrectly received
		'4'  --> The ACK length incorrectly received
		'3'  --> N-ACK received
		'2'  --> The ACK has not been received
		'1'  --> not used (reserved)
		'0'  --> The ACK has been received with no errors */
//uint8_t BSP_SX1272_sendPacketMAXTimeoutACK(uint8_t dest,
//								uint8_t *payload,
//								uint16_t length);

// It sends the packet which payload is a parameter before a timeout,
// and replies with ACK.
/*\param uint8_t dest : packet destination.
\param uint8_t payload: packet payload.
\param uint16_t length : payload buffer length.
\return '9'  --> The ACK lost (no data available)
		'8'  --> The ACK lost
		'7'  --> The ACK destination incorrectly received
		'6'  --> The ACK source incorrectly received
		'5'  --> The ACK number incorrectly received
		'4'  --> The ACK length incorrectly received
		'3'  --> N-ACK received
		'2'  --> The ACK has not been received
		'1'  --> not used (reserved)
		'0'  --> The ACK has been received with no errors*/
//uint8_t sendPacketTimeoutACK(	uint8_t dest,
//								uint8_t *payload,
//								uint16_t length);

