Wakayo-Quozorox/SACS/STM32/bsp/inc/SX1272.h
// It sends the packet which payload is a parameter before 'wait' time,
// and replies with ACK.
/* \param uint8_t dest : packet destination.
\param char *payload : packet payload.
\param uint32_t wait : time to wait to send the packet.
\return '9'  --> The ACK lost (no data available)
		'8'  --> The ACK lost
		'7'  --> The ACK destination incorrectly received
		'6'  --> The ACK source incorrectly received
		'5'  --> The ACK number incorrectly received
		'4'  --> The ACK length incorrectly received
		'3'  --> N-ACK received
		'2'  --> The ACK has not been received
		'1'  --> not used (reserved)
		'0'  --> The ACK has been received with no errors */
uint8_t BSP_SX1272_sendPacketTimeoutACK(	uint8_t dest,
								char *payload,
								uint32_t wait);

// It sends the packet which payload is a parameter before 'wait' time,
// and replies with ACK.
/* \param uint8_t dest : packet destination.
\param uint8_t payload: packet payload.
\param uint16_t length : payload buffer length.
\param uint32_t wait : time to wait to send the packet.
\return '9'  --> The ACK lost (no data available)
		'8'  --> The ACK lost
		'7'  --> The ACK destination incorrectly received
		'6'  --> The ACK source incorrectly received
		'5'  --> The ACK number incorrectly received
		'4'  --> The ACK length incorrectly received
		'3'  --> N-ACK received
		'2'  --> The ACK has not been received
		'1'  --> not used (reserved)
		'0'  --> The ACK has been received with no errors */
/*uint8_t BSP_SX1272_sendPacketTimeoutACK(uint8_t dest,
								uint8_t *payload,
								uint16_t length,
								uint32_t wait);*/

// It sets the destination of a packet.
/* \param uint8_t dest : value to set as destination address.
\return '0' on success, '1' otherwise */
int8_t BSP_SX1272_setDestination(uint8_t dest);

// It sets the waiting time to send a packet.
/*It stores in global '_sendTime' variable the time for each mode.
\return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_setTimeout();

// It gets the theoretical value of the time-on-air of the packet
/* \remarks http://www.semtech.com/images/datasheet/sx1272.pdf
It stores in global '_sendTime' variable the time for each mode.
\return float: time on air depending on module settings and packet length */
float BSP_SX1272_timeOnAir( uint16_t payloadlength );

// It sets the payload of the packet that is going to be sent.
/* \param char *payload : packet payload.
\return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_setPayload(char *payload);

// It sets the payload of the packet that is going to be sent.
/*\param uint8_t payload: packet payload.
\return '0' on success, '1' otherwise */
//uint8_t BSP_SX1272_setPayload(uint8_t *payload);

// It receives and gets an ACK from FIFO, if it arrives before ending
// 'wait' time.
/* *
\param uint32_t wait : time to wait while there is no an ACK received.
\return '8'  --> The ACK lost
		'7'  --> The ACK destination incorrectly received
		'6'  --> The ACK source incorrectly received
		'5'  --> The ACK number incorrectly received
		'4'  --> The ACK length incorrectly received
		'3'  --> N-ACK received
		'2'  --> The ACK has not been received
		'1'  --> not used (reserved)
		'0'  --> The ACK has been received with no errors */
uint8_t BSP_SX1272_getACK(uint32_t wait);

// It sends a packet, waits to receive an ACK and updates the _retries
// value, before ending MAX_TIMEOUT time.
/* \param uint8_t dest : packet destination.
\param uint8_t *payload : packet payload.
\param uint16_t length : payload buffer length.
\return '0' on success, '1' otherwise */
//uint8_t BSP_SX1272_sendPacketMAXTimeoutACKRetries(	uint8_t dest,
//										uint8_t *payload,
//										uint16_t length);

// It sends a packet, waits to receive an ACK and updates the _retries
// value, before ending 'wait' time.
/* \param uint8_t dest : packet destination.
\param char *payload : packet payload.
\param uint32_t wait : time to wait while trying to send the packet.
\return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_sendPacketTimeoutACKRetries(uint8_t dest,
									char *payload,
									uint32_t wait);

// It sends a packet, waits to receive an ACK and updates the _retries
// value, before ending 'wait' time.
/* \param uint8_t dest : packet destination.
\param uint8_t *payload : packet payload.
\param uint16_t length : payload buffer length.
\param uint32_t wait : time to wait while trying to send the packet.
\return '0' on success, '1' otherwise*/
//uint8_t BSP_SX1272_sendPacketTimeoutACKRetries(uint8_t dest,
//									uint8_t *payload,
//									uint16_t length,
//									uint32_t wait);

// It gets the internal temperature of the module.
/* It stores in global '_temp' variable the module temperature.
\return '0' on success, '1' otherwise */
uint8_t BSP_SX1272_getTemp();


/*
Function: It sets the CAD mode to search Channel Activity Detection
Returns: Integer that determines if there has been any error
state = true   --> Channel Activity Detected
state = false  --> Channel Activity NOT Detected*/
uint8_t BSP_SX1272_cadDetected();

#endif /* BSP_INC_SX1272_H_ */
